// 15.6寸+i5+1050ti+16g。

// 联想拯救者y7000，（可靠的售后，相对可靠的质量和品控，相对不太大）
// 惠普暗夜精灵4，（可靠的售后，相对可靠的质量和品控，相对不太大）
// Acer暗影骑士3，（及格的售后，相对可靠的质量和品控，相对不太大）

// 神舟z7，k680，k690，（基本能修好的售后，够便宜，拓展性好，皮实，热门，但是完全不便携）
// 技嘉Aero15，（能修好的售后，可靠的质量和品控，轻，薄，贵，颜值高，冷门）
// 微星gs系列，（及格的售后，可靠的质量和品控，轻，薄，贵，冷门）
// 这些口碑比较好的型号都有如上配置的版本。

// 小米笔记本pro 目前5400，更推荐高配。华为小米的续航反馈都比较好，小米pro在ubuntu上基本无痛驱动
// dell xps 15 9370可以说是15寸常规本里做得最平衡的一款了。

// 以45% tn 768p 7分为起点，72% ips 1080p 打10分（纯属个人打分）
// 不考虑2k、4k和105%等屏幕，那些目前毕竟还是小众，用更高色域的屏幕来展示真实世界的颜色，对于一般人纯属浪费。